{
  "word2idx": {
    "<PAD>": 4,
    "<SOS>": 4,
    "<EOS>": 4,
    "<UNK>": 4,
    "hello": 4,
    "!": 5,
    "i": 6,
    "am": 7,
    "serlin": 8,
    ",": 9,
    "nice": 10,
    "to": 11,
    "meet": 12,
    "you": 13,
    ".": 14,
    "how": 15,
    "are": 16,
    "'": 17,
    "m": 18,
    "doing": 19,
    "well": 20,
    "thank": 21,
    "for": 22,
    "asking": 23,
    "about": 24,
    "?": 25,
    "what": 26,
    "is": 27,
    "your": 28,
    "name": 29,
    "my": 30,
    "an": 31,
    "ai": 32,
    "assistant": 33,
    "can": 34,
    "do": 35,
    "answer": 36,
    "questions": 37,
    "chat": 38,
    "and": 39,
    "learn": 40,
    "new": 41,
    "knowledge": 42,
    "the": 43,
    "weather": 44,
    "today": 45,
    "cannot": 46,
    "access": 47,
    "real": 48,
    "-": 49,
    "time": 50,
    "please": 51,
    "check": 52,
    "a": 53,
    "forecast": 54,
    "tell": 55,
    "me": 56,
    "joke": 57,
    "why": 58,
    "programmers": 59,
    "always": 60,
    "mix": 61,
    "up": 62,
    "halloween": 63,
    "christmas": 64,
    "because": 65,
    "oct": 66,
    "31": 67,
    "=": 68,
    "dec": 69,
    "25": 70,
    "artificial": 71,
    "intelligence": 72,
    "technology": 73,
    "that": 74,
    "enables": 75,
    "machines": 76,
    "simulate": 77,
    "human": 78,
    "yes": 79,
    "from": 80,
    "conversations": 81,
    "improve": 82,
    "myself": 83,
    "goodbye": 84,
    "looking": 85,
    "forward": 86,
    "our": 87,
    "next": 88,
    "re": 89,
    "welcome": 90,
    "here": 91,
    "help": 92,
    "anytime": 93,
    "he": 94,
    "she": 95,
    "it": 96,
    "we": 97,
    "they": 98,
    "this": 99,
    "which": 100,
    "who": 101,
    "was": 102,
    "were": 103,
    "be": 104,
    "being": 105,
    "been": 106,
    "have": 107,
    "has": 108,
    "had": 109,
    "does": 110,
    "did": 111,
    "could": 112,
    "will": 113,
    "would": 114,
    "should": 115,
    "may": 116,
    "might": 117,
    "say": 118,
    "ask": 119,
    "know": 120,
    "think": 121,
    "feel": 122,
    "good": 123,
    "bad": 124,
    "right": 125,
    "wrong": 126,
    "happy": 127,
    "sad": 128,
    "like": 129,
    "love": 130,
    "hate": 131,
    "want": 132,
    "need": 133,
    "hi": 134,
    "hey": 135,
    "bye": 136,
    "thanks": 137,
    "thank you": 138,
    "no": 139,
    "okay": 140,
    "ok": 141,
    "sorry": 142,
    "day": 143,
    "tomorrow": 144,
    "yesterday": 145,
    "now": 146,
    "later": 147,
    "person": 148,
    "people": 149,
    "friend": 150,
    "teacher": 151,
    "student": 152,
    "computer": 153,
    "phone": 154,
    "work": 155,
    "understand": 156,
    "explain": 157,
    "problem": 158,
    "question": 159,
    "thing": 160,
    "something": 161,
    "nothing": 162,
    "one": 163,
    "two": 164,
    "three": 165,
    "four": 166,
    "five": 167,
    "ten": 168,
    "hundred": 169,
    "thousand": 170,
    "million": 171,
    "first": 172,
    "second": 173,
    "third": 174,
    "last": 175,
    "previous": 176,
    "down": 177,
    "left": 178,
    "front": 179,
    "back": 180,
    "inside": 181,
    "outside": 182,
    "year": 183,
    "month": 184,
    "week": 185,
    "hour": 186,
    "minute": 187
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "<PAD>",
    "5": "<SOS>",
    "6": "<EOS>",
    "7": "<UNK>",
    "8": "hello",
    "9": "!",
    "10": "i",
    "11": "am",
    "12": "serlin",
    "13": ",",
    "14": "nice",
    "15": "to",
    "16": "meet",
    "17": "you",
    "18": ".",
    "19": "how",
    "20": "are",
    "21": "'",
    "22": "m",
    "23": "doing",
    "24": "well",
    "25": "thank",
    "26": "for",
    "27": "asking",
    "28": "about",
    "29": "?",
    "30": "what",
    "31": "is",
    "32": "your",
    "33": "name",
    "34": "my",
    "35": "an",
    "36": "ai",
    "37": "assistant",
    "38": "can",
    "39": "do",
    "40": "answer",
    "41": "questions",
    "42": "chat",
    "43": "and",
    "44": "learn",
    "45": "new",
    "46": "knowledge",
    "47": "the",
    "48": "weather",
    "49": "today",
    "50": "cannot",
    "51": "access",
    "52": "real",
    "53": "-",
    "54": "time",
    "55": "please",
    "56": "check",
    "57": "a",
    "58": "forecast",
    "59": "tell",
    "60": "me",
    "61": "joke",
    "62": "why",
    "63": "programmers",
    "64": "always",
    "65": "mix",
    "66": "up",
    "67": "halloween",
    "68": "christmas",
    "69": "because",
    "70": "oct",
    "71": "31",
    "72": "=",
    "73": "dec",
    "74": "25",
    "75": "artificial",
    "76": "intelligence",
    "77": "technology",
    "78": "that",
    "79": "enables",
    "80": "machines",
    "81": "simulate",
    "82": "human",
    "83": "yes",
    "84": "from",
    "85": "conversations",
    "86": "improve",
    "87": "myself",
    "88": "goodbye",
    "89": "looking",
    "90": "forward",
    "91": "our",
    "92": "next",
    "93": "re",
    "94": "he",
    "95": "she",
    "96": "it",
    "97": "we",
    "98": "they",
    "99": "this",
    "100": "which",
    "101": "who",
    "102": "was",
    "103": "were",
    "104": "be",
    "105": "being",
    "106": "been",
    "107": "have",
    "108": "has",
    "109": "had",
    "110": "does",
    "111": "did",
    "112": "could",
    "113": "will",
    "114": "would",
    "115": "should",
    "116": "may",
    "117": "might",
    "118": "say",
    "119": "ask",
    "120": "know",
    "121": "think",
    "122": "feel",
    "123": "good",
    "124": "bad",
    "125": "right",
    "126": "wrong",
    "127": "happy",
    "128": "sad",
    "129": "like",
    "130": "love",
    "131": "hate",
    "132": "want",
    "133": "need",
    "134": "hi",
    "135": "hey",
    "136": "bye",
    "137": "thanks",
    "138": "thank you",
    "139": "no",
    "140": "okay",
    "141": "ok",
    "142": "sorry",
    "143": "day",
    "144": "tomorrow",
    "145": "yesterday",
    "146": "now",
    "147": "later",
    "148": "person",
    "149": "people",
    "150": "friend",
    "151": "teacher",
    "152": "student",
    "153": "computer",
    "154": "phone",
    "155": "work",
    "156": "understand",
    "157": "explain",
    "158": "problem",
    "159": "question",
    "160": "thing",
    "161": "something",
    "162": "nothing",
    "163": "one",
    "164": "two",
    "165": "three",
    "166": "four",
    "167": "five",
    "168": "ten",
    "169": "hundred",
    "170": "thousand",
    "171": "million",
    "172": "first",
    "173": "second",
    "174": "third",
    "175": "last",
    "176": "previous",
    "177": "down",
    "178": "left",
    "179": "front",
    "180": "back",
    "181": "inside",
    "182": "outside",
    "183": "year",
    "184": "month",
    "185": "week",
    "186": "hour",
    "187": "minute"
  },
  "vocab_size": 188
}